Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_pads_bank0.h
/*
; RP2350_pads_bank0.
; ==================

; SPDX-License-Identifier: MIT

;------------------------------------------------------------------------
; Author:   Generated using the .svd description    The 2025-01-01
; Modifs:
;
; Project:  uKOS-X
; Goal:     RP2350_pads_bank0 equates.
;
;   (c) 2025-2026, Edo. Franzi
;   --------------------------
;                                              __ ______  _____
;   Edo. Franzi                         __  __/ //_/ __ \/ ___/
;   5-Route de Cheseaux                / / / / ,< / / / /\__ \
;   CH 1400 Cheseaux-Noréaz           / /_/ / /| / /_/ /___/ /
;                                     \__,_/_/ |_\____//____/
;   edo.franzi@ukos.ch
;
;   Description: Lightweight, real-time multitasking operating
;   system for embedded microcontroller and DSP-based systems.
;
;   Permission is hereby granted, free of charge, to any person
;   obtaining a copy of this software and associated documentation
;   files (the "Software"), to deal in the Software without restriction,
;   including without limitation the rights to use, copy, modify,
;   merge, publish, distribute, sublicense, and/or sell copies of the
;   Software, and to permit persons to whom the Software is furnished
;   to do so, subject to the following conditions:
;
;   The above copyright notice and this permission notice shall be
;   included in all copies or substantial portions of the Software.
;
;   THE SOFTWARE IS PROVIDED "AS IS", WITHOUT WARRANTY OF ANY KIND,
;   EXPRESS OR IMPLIED, INCLUDING BUT NOT LIMITED TO THE WARRANTIES OF
;   MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE AND
;   NONINFRINGEMENT. IN NO EVENT SHALL THE AUTHORS OR COPYRIGHT HOLDERS
;   BE LIABLE FOR ANY CLAIM, DAMAGES OR OTHER LIABILITY, WHETHER IN AN
;   ACTION OF CONTRACT, TORT OR OTHERWISE, ARISING FROM, OUT OF OR IN
;   CONNECTION WITH THE SOFTWARE OR THE USE OR OTHER DEALINGS IN THE
;   SOFTWARE.
;
;------------------------------------------------------------------------
*/

#pragma once

#include    <stdint.h>

// PADS_BANK0 address definitions
// ------------------------------

typedef struct {
    volatile    uint32_t    VOLTAGE_SELECT;
    volatile    uint32_t    GPIO0;
    volatile    uint32_t    GPIO1;
    volatile    uint32_t    GPIO2;
    volatile    uint32_t    GPIO3;
    volatile    uint32_t    GPIO4;
    volatile    uint32_t    GPIO5;
    volatile    uint32_t    GPIO6;
    volatile    uint32_t    GPIO7;
    volatile    uint32_t    GPIO8;
    volatile    uint32_t    GPIO9;
    volatile    uint32_t    GPIO10;
    volatile    uint32_t    GPIO11;
    volatile    uint32_t    GPIO12;
    volatile    uint32_t    GPIO13;
    volatile    uint32_t    GPIO14;
    volatile    uint32_t    GPIO15;
    volatile    uint32_t    GPIO16;
    volatile    uint32_t    GPIO17;
    volatile    uint32_t    GPIO18;
    volatile    uint32_t    GPIO19;
    volatile    uint32_t    GPIO20;
    volatile    uint32_t    GPIO21;
    volatile    uint32_t    GPIO22;
    volatile    uint32_t    GPIO23;
    volatile    uint32_t    GPIO24;
    volatile    uint32_t    GPIO25;
    volatile    uint32_t    GPIO26;
    volatile    uint32_t    GPIO27;
    volatile    uint32_t    GPIO28;
    volatile    uint32_t    GPIO29;
    volatile    uint32_t    GPIO30;
    volatile    uint32_t    GPIO31;
    volatile    uint32_t    GPIO32;
    volatile    uint32_t    GPIO33;
    volatile    uint32_t    GPIO34;
    volatile    uint32_t    GPIO35;
    volatile    uint32_t    GPIO36;
    volatile    uint32_t    GPIO37;
    volatile    uint32_t    GPIO38;
    volatile    uint32_t    GPIO39;
    volatile    uint32_t    GPIO40;
    volatile    uint32_t    GPIO41;
    volatile    uint32_t    GPIO42;
    volatile    uint32_t    GPIO43;
    volatile    uint32_t    GPIO44;
    volatile    uint32_t    GPIO45;
    volatile    uint32_t    GPIO46;
    volatile    uint32_t    GPIO47;
    volatile    uint32_t    SWCLK;
    volatile    uint32_t    SWD;
} PADS_BANK0_TypeDef;

#ifdef __cplusplus
#define PADS_BANK0_NS   reinterpret_cast<PADS_BANK0_TypeDef *>(0x40038000u)
#define PADS_BANK0_S    reinterpret_cast<PADS_BANK0_TypeDef *>(0x40038000u)
#else
#define PADS_BANK0_NS   ((PADS_BANK0_TypeDef *)0x40038000u)
#define PADS_BANK0_S    ((PADS_BANK0_TypeDef *)0x40038000u)
#endif

// VOLTAGE_SELECT Configuration

#define PADS_BANK0_VOLTAGE_SELECT_VOLTAGE_SELECT        (0x1u<<0)
#define PADS_BANK0_VOLTAGE_SELECT_VOLTAGE_SELECT_3V3    (0x0u<<0)
#define PADS_BANK0_VOLTAGE_SELECT_VOLTAGE_SELECT_1V8    (0x1u<<0)

// GPIO0 Configuration

#define PADS_BANK0_GPIO0_SLEWFAST                       (0x1u<<0)
#define PADS_BANK0_GPIO0_SCHMITT                        (0x1u<<1)
#define PADS_BANK0_GPIO0_PDE                            (0x1u<<2)
#define PADS_BANK0_GPIO0_PUE                            (0x1u<<3)
#define PADS_BANK0_GPIO0_DRIVE                          (0x3u<<4)
#define PADS_BANK0_GPIO0_DRIVE_0                        (0x1u<<4)
#define PADS_BANK0_GPIO0_IE                             (0x1u<<6)
#define PADS_BANK0_GPIO0_OD                             (0x1u<<7)
#define PADS_BANK0_GPIO0_ISO                            (0x1u<<8)
#define PADS_BANK0_GPIO0_DRIVE_2MA                      (0x0u<<4)
#define PADS_BANK0_GPIO0_DRIVE_4MA                      (0x1u<<4)
#define PADS_BANK0_GPIO0_DRIVE_8MA                      (0x2u<<4)
#define PADS_BANK0_GPIO0_DRIVE_12MA                     (0x3u<<4)

// GPIO1 Configuration

#define PADS_BANK0_GPIO1_SLEWFAST                       (0x1u<<0)
#define PADS_BANK0_GPIO1_SCHMITT                        (0x1u<<1)
#define PADS_BANK0_GPIO1_PDE                            (0x1u<<2)
#define PADS_BANK0_GPIO1_PUE                            (0x1u<<3)
#define PADS_BANK0_GPIO1_DRIVE                          (0x3u<<4)
#define PADS_BANK0_GPIO1_DRIVE_0                        (0x1u<<4)
#define PADS_BANK0_GPIO1_IE                             (0x1u<<6)
#define PADS_BANK0_GPIO1_OD                             (0x1u<<7)
#define PADS_BANK0_GPIO1_ISO                            (0x1u<<8)
#define PADS_BANK0_GPIO1_DRIVE_2MA                      (0x0u<<4)
#define PADS_BANK0_GPIO1_DRIVE_4MA                      (0x1u<<4)
#define PADS_BANK0_GPIO1_DRIVE_8MA                      (0x2u<<4)
#define PADS_BANK0_GPIO1_DRIVE_12MA                     (0x3u<<4)

