Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_pads_bank0.h
// GPIO2 Configuration

#define PADS_BANK0_GPIO2_SLEWFAST                       (0x1u<<0)
#define PADS_BANK0_GPIO2_SCHMITT                        (0x1u<<1)
#define PADS_BANK0_GPIO2_PDE                            (0x1u<<2)
#define PADS_BANK0_GPIO2_PUE                            (0x1u<<3)
#define PADS_BANK0_GPIO2_DRIVE                          (0x3u<<4)
#define PADS_BANK0_GPIO2_DRIVE_0                        (0x1u<<4)
#define PADS_BANK0_GPIO2_IE                             (0x1u<<6)
#define PADS_BANK0_GPIO2_OD                             (0x1u<<7)
#define PADS_BANK0_GPIO2_ISO                            (0x1u<<8)
#define PADS_BANK0_GPIO2_DRIVE_2MA                      (0x0u<<4)
#define PADS_BANK0_GPIO2_DRIVE_4MA                      (0x1u<<4)
#define PADS_BANK0_GPIO2_DRIVE_8MA                      (0x2u<<4)
#define PADS_BANK0_GPIO2_DRIVE_12MA                     (0x3u<<4)

// GPIO3 Configuration

#define PADS_BANK0_GPIO3_SLEWFAST                       (0x1u<<0)
#define PADS_BANK0_GPIO3_SCHMITT                        (0x1u<<1)
#define PADS_BANK0_GPIO3_PDE                            (0x1u<<2)
#define PADS_BANK0_GPIO3_PUE                            (0x1u<<3)
#define PADS_BANK0_GPIO3_DRIVE                          (0x3u<<4)
#define PADS_BANK0_GPIO3_DRIVE_0                        (0x1u<<4)
#define PADS_BANK0_GPIO3_IE                             (0x1u<<6)
#define PADS_BANK0_GPIO3_OD                             (0x1u<<7)
#define PADS_BANK0_GPIO3_ISO                            (0x1u<<8)
#define PADS_BANK0_GPIO3_DRIVE_2MA                      (0x0u<<4)
#define PADS_BANK0_GPIO3_DRIVE_4MA                      (0x1u<<4)
#define PADS_BANK0_GPIO3_DRIVE_8MA                      (0x2u<<4)
#define PADS_BANK0_GPIO3_DRIVE_12MA                     (0x3u<<4)

// GPIO4 Configuration

#define PADS_BANK0_GPIO4_SLEWFAST                       (0x1u<<0)
#define PADS_BANK0_GPIO4_SCHMITT                        (0x1u<<1)
#define PADS_BANK0_GPIO4_PDE                            (0x1u<<2)
#define PADS_BANK0_GPIO4_PUE                            (0x1u<<3)
#define PADS_BANK0_GPIO4_DRIVE                          (0x3u<<4)
#define PADS_BANK0_GPIO4_DRIVE_0                        (0x1u<<4)
#define PADS_BANK0_GPIO4_IE                             (0x1u<<6)
#define PADS_BANK0_GPIO4_OD                             (0x1u<<7)
#define PADS_BANK0_GPIO4_ISO                            (0x1u<<8)
#define PADS_BANK0_GPIO4_DRIVE_2MA                      (0x0u<<4)
#define PADS_BANK0_GPIO4_DRIVE_4MA                      (0x1u<<4)
#define PADS_BANK0_GPIO4_DRIVE_8MA                      (0x2u<<4)
#define PADS_BANK0_GPIO4_DRIVE_12MA                     (0x3u<<4)

// GPIO5 Configuration

#define PADS_BANK0_GPIO5_SLEWFAST                       (0x1u<<0)
#define PADS_BANK0_GPIO5_SCHMITT                        (0x1u<<1)
#define PADS_BANK0_GPIO5_PDE                            (0x1u<<2)
#define PADS_BANK0_GPIO5_PUE                            (0x1u<<3)
#define PADS_BANK0_GPIO5_DRIVE                          (0x3u<<4)
#define PADS_BANK0_GPIO5_DRIVE_0                        (0x1u<<4)
#define PADS_BANK0_GPIO5_IE                             (0x1u<<6)
#define PADS_BANK0_GPIO5_OD                             (0x1u<<7)
#define PADS_BANK0_GPIO5_ISO                            (0x1u<<8)
#define PADS_BANK0_GPIO5_DRIVE_2MA                      (0x0u<<4)
#define PADS_BANK0_GPIO5_DRIVE_4MA                      (0x1u<<4)
#define PADS_BANK0_GPIO5_DRIVE_8MA                      (0x2u<<4)
#define PADS_BANK0_GPIO5_DRIVE_12MA                     (0x3u<<4)

// GPIO6 Configuration

#define PADS_BANK0_GPIO6_SLEWFAST                       (0x1u<<0)
#define PADS_BANK0_GPIO6_SCHMITT                        (0x1u<<1)
#define PADS_BANK0_GPIO6_PDE                            (0x1u<<2)
#define PADS_BANK0_GPIO6_PUE                            (0x1u<<3)
#define PADS_BANK0_GPIO6_DRIVE                          (0x3u<<4)
#define PADS_BANK0_GPIO6_DRIVE_0                        (0x1u<<4)
#define PADS_BANK0_GPIO6_IE                             (0x1u<<6)
#define PADS_BANK0_GPIO6_OD                             (0x1u<<7)
#define PADS_BANK0_GPIO6_ISO                            (0x1u<<8)
#define PADS_BANK0_GPIO6_DRIVE_2MA                      (0x0u<<4)
#define PADS_BANK0_GPIO6_DRIVE_4MA                      (0x1u<<4)
#define PADS_BANK0_GPIO6_DRIVE_8MA                      (0x2u<<4)
#define PADS_BANK0_GPIO6_DRIVE_12MA                     (0x3u<<4)

// GPIO7 Configuration

#define PADS_BANK0_GPIO7_SLEWFAST                       (0x1u<<0)
#define PADS_BANK0_GPIO7_SCHMITT                        (0x1u<<1)
#define PADS_BANK0_GPIO7_PDE                            (0x1u<<2)
#define PADS_BANK0_GPIO7_PUE                            (0x1u<<3)
#define PADS_BANK0_GPIO7_DRIVE                          (0x3u<<4)
#define PADS_BANK0_GPIO7_DRIVE_0                        (0x1u<<4)
#define PADS_BANK0_GPIO7_IE                             (0x1u<<6)
#define PADS_BANK0_GPIO7_OD                             (0x1u<<7)
#define PADS_BANK0_GPIO7_ISO                            (0x1u<<8)
#define PADS_BANK0_GPIO7_DRIVE_2MA                      (0x0u<<4)
#define PADS_BANK0_GPIO7_DRIVE_4MA                      (0x1u<<4)
#define PADS_BANK0_GPIO7_DRIVE_8MA                      (0x2u<<4)
#define PADS_BANK0_GPIO7_DRIVE_12MA                     (0x3u<<4)

// GPIO8 Configuration

#define PADS_BANK0_GPIO8_SLEWFAST                       (0x1u<<0)
#define PADS_BANK0_GPIO8_SCHMITT                        (0x1u<<1)
#define PADS_BANK0_GPIO8_PDE                            (0x1u<<2)
#define PADS_BANK0_GPIO8_PUE                            (0x1u<<3)
#define PADS_BANK0_GPIO8_DRIVE                          (0x3u<<4)
#define PADS_BANK0_GPIO8_DRIVE_0                        (0x1u<<4)
#define PADS_BANK0_GPIO8_IE                             (0x1u<<6)
#define PADS_BANK0_GPIO8_OD                             (0x1u<<7)
#define PADS_BANK0_GPIO8_ISO                            (0x1u<<8)
#define PADS_BANK0_GPIO8_DRIVE_2MA                      (0x0u<<4)
#define PADS_BANK0_GPIO8_DRIVE_4MA                      (0x1u<<4)
#define PADS_BANK0_GPIO8_DRIVE_8MA                      (0x2u<<4)
#define PADS_BANK0_GPIO8_DRIVE_12MA                     (0x3u<<4)

// GPIO9 Configuration

#define PADS_BANK0_GPIO9_SLEWFAST                       (0x1u<<0)
#define PADS_BANK0_GPIO9_SCHMITT                        (0x1u<<1)
#define PADS_BANK0_GPIO9_PDE                            (0x1u<<2)
#define PADS_BANK0_GPIO9_PUE                            (0x1u<<3)
#define PADS_BANK0_GPIO9_DRIVE                          (0x3u<<4)
#define PADS_BANK0_GPIO9_DRIVE_0                        (0x1u<<4)
#define PADS_BANK0_GPIO9_IE                             (0x1u<<6)
#define PADS_BANK0_GPIO9_OD                             (0x1u<<7)
#define PADS_BANK0_GPIO9_ISO                            (0x1u<<8)
#define PADS_BANK0_GPIO9_DRIVE_2MA                      (0x0u<<4)
#define PADS_BANK0_GPIO9_DRIVE_4MA                      (0x1u<<4)
#define PADS_BANK0_GPIO9_DRIVE_8MA                      (0x2u<<4)
#define PADS_BANK0_GPIO9_DRIVE_12MA                     (0x3u<<4)

// GPIO10 Configuration

#define PADS_BANK0_GPIO10_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO10_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO10_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO10_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO10_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO10_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO10_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO10_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO10_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO10_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO10_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO10_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO10_DRIVE_12MA                    (0x3u<<4)

// GPIO11 Configuration

