Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_pads_bank0.h
#define PADS_BANK0_GPIO11_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO11_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO11_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO11_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO11_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO11_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO11_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO11_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO11_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO11_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO11_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO11_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO11_DRIVE_12MA                    (0x3u<<4)

// GPIO12 Configuration

#define PADS_BANK0_GPIO12_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO12_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO12_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO12_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO12_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO12_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO12_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO12_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO12_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO12_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO12_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO12_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO12_DRIVE_12MA                    (0x3u<<4)

// GPIO13 Configuration

#define PADS_BANK0_GPIO13_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO13_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO13_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO13_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO13_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO13_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO13_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO13_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO13_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO13_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO13_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO13_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO13_DRIVE_12MA                    (0x3u<<4)

// GPIO14 Configuration

#define PADS_BANK0_GPIO14_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO14_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO14_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO14_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO14_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO14_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO14_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO14_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO14_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO14_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO14_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO14_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO14_DRIVE_12MA                    (0x3u<<4)

// GPIO15 Configuration

#define PADS_BANK0_GPIO15_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO15_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO15_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO15_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO15_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO15_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO15_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO15_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO15_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO15_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO15_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO15_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO15_DRIVE_12MA                    (0x3u<<4)

// GPIO16 Configuration

#define PADS_BANK0_GPIO16_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO16_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO16_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO16_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO16_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO16_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO16_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO16_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO16_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO16_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO16_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO16_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO16_DRIVE_12MA                    (0x3u<<4)

// GPIO17 Configuration

#define PADS_BANK0_GPIO17_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO17_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO17_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO17_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO17_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO17_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO17_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO17_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO17_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO17_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO17_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO17_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO17_DRIVE_12MA                    (0x3u<<4)

