Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_pads_bank0.h
// GPIO18 Configuration

#define PADS_BANK0_GPIO18_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO18_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO18_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO18_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO18_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO18_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO18_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO18_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO18_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO18_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO18_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO18_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO18_DRIVE_12MA                    (0x3u<<4)

// GPIO19 Configuration

#define PADS_BANK0_GPIO19_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO19_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO19_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO19_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO19_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO19_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO19_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO19_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO19_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO19_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO19_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO19_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO19_DRIVE_12MA                    (0x3u<<4)

// GPIO20 Configuration

#define PADS_BANK0_GPIO20_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO20_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO20_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO20_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO20_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO20_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO20_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO20_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO20_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO20_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO20_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO20_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO20_DRIVE_12MA                    (0x3u<<4)

// GPIO21 Configuration

#define PADS_BANK0_GPIO21_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO21_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO21_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO21_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO21_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO21_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO21_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO21_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO21_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO21_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO21_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO21_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO21_DRIVE_12MA                    (0x3u<<4)

// GPIO22 Configuration

#define PADS_BANK0_GPIO22_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO22_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO22_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO22_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO22_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO22_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO22_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO22_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO22_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO22_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO22_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO22_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO22_DRIVE_12MA                    (0x3u<<4)

// GPIO23 Configuration

#define PADS_BANK0_GPIO23_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO23_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO23_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO23_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO23_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO23_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO23_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO23_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO23_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO23_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO23_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO23_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO23_DRIVE_12MA                    (0x3u<<4)

// GPIO24 Configuration

#define PADS_BANK0_GPIO24_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO24_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO24_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO24_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO24_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO24_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO24_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO24_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO24_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO24_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO24_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO24_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO24_DRIVE_12MA                    (0x3u<<4)

// GPIO25 Configuration

#define PADS_BANK0_GPIO25_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO25_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO25_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO25_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO25_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO25_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO25_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO25_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO25_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO25_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO25_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO25_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO25_DRIVE_12MA                    (0x3u<<4)

// GPIO26 Configuration

#define PADS_BANK0_GPIO26_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO26_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO26_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO26_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO26_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO26_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO26_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO26_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO26_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO26_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO26_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO26_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO26_DRIVE_12MA                    (0x3u<<4)

// GPIO27 Configuration

#define PADS_BANK0_GPIO27_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO27_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO27_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO27_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO27_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO27_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO27_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO27_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO27_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO27_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO27_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO27_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO27_DRIVE_12MA                    (0x3u<<4)

// GPIO28 Configuration

#define PADS_BANK0_GPIO28_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO28_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO28_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO28_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO28_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO28_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO28_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO28_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO28_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO28_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO28_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO28_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO28_DRIVE_12MA                    (0x3u<<4)

// GPIO29 Configuration

#define PADS_BANK0_GPIO29_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO29_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO29_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO29_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO29_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO29_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO29_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO29_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO29_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO29_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO29_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO29_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO29_DRIVE_12MA                    (0x3u<<4)

