Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_pads_bank0.h
// GPIO30 Configuration

#define PADS_BANK0_GPIO30_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO30_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO30_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO30_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO30_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO30_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO30_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO30_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO30_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO30_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO30_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO30_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO30_DRIVE_12MA                    (0x3u<<4)

// GPIO31 Configuration

#define PADS_BANK0_GPIO31_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO31_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO31_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO31_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO31_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO31_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO31_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO31_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO31_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO31_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO31_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO31_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO31_DRIVE_12MA                    (0x3u<<4)

// GPIO32 Configuration

#define PADS_BANK0_GPIO32_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO32_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO32_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO32_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO32_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO32_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO32_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO32_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO32_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO32_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO32_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO32_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO32_DRIVE_12MA                    (0x3u<<4)

// GPIO33 Configuration

#define PADS_BANK0_GPIO33_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO33_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO33_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO33_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO33_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO33_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO33_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO33_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO33_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO33_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO33_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO33_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO33_DRIVE_12MA                    (0x3u<<4)

// GPIO34 Configuration

#define PADS_BANK0_GPIO34_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO34_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO34_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO34_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO34_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO34_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO34_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO34_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO34_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO34_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO34_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO34_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO34_DRIVE_12MA                    (0x3u<<4)

// GPIO35 Configuration

#define PADS_BANK0_GPIO35_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO35_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO35_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO35_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO35_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO35_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO35_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO35_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO35_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO35_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO35_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO35_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO35_DRIVE_12MA                    (0x3u<<4)

// GPIO36 Configuration

#define PADS_BANK0_GPIO36_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO36_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO36_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO36_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO36_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO36_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO36_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO36_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO36_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO36_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO36_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO36_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO36_DRIVE_12MA                    (0x3u<<4)

// GPIO37 Configuration

