Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_pads_bank0.h
#define PADS_BANK0_GPIO37_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO37_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO37_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO37_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO37_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO37_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO37_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO37_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO37_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO37_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO37_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO37_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO37_DRIVE_12MA                    (0x3u<<4)

// GPIO38 Configuration

#define PADS_BANK0_GPIO38_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO38_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO38_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO38_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO38_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO38_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO38_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO38_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO38_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO38_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO38_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO38_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO38_DRIVE_12MA                    (0x3u<<4)

// GPIO39 Configuration

#define PADS_BANK0_GPIO39_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO39_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO39_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO39_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO39_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO39_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO39_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO39_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO39_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO39_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO39_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO39_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO39_DRIVE_12MA                    (0x3u<<4)

// GPIO40 Configuration

#define PADS_BANK0_GPIO40_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO40_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO40_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO40_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO40_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO40_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO40_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO40_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO40_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO40_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO40_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO40_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO40_DRIVE_12MA                    (0x3u<<4)

// GPIO41 Configuration

#define PADS_BANK0_GPIO41_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO41_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO41_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO41_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO41_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO41_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO41_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO41_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO41_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO41_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO41_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO41_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO41_DRIVE_12MA                    (0x3u<<4)

// GPIO42 Configuration

#define PADS_BANK0_GPIO42_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO42_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO42_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO42_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO42_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO42_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO42_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO42_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO42_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO42_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO42_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO42_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO42_DRIVE_12MA                    (0x3u<<4)

// GPIO43 Configuration

#define PADS_BANK0_GPIO43_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO43_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO43_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO43_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO43_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO43_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO43_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO43_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO43_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO43_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO43_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO43_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO43_DRIVE_12MA                    (0x3u<<4)

// GPIO44 Configuration

#define PADS_BANK0_GPIO44_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO44_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO44_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO44_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO44_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO44_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO44_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO44_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO44_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO44_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO44_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO44_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO44_DRIVE_12MA                    (0x3u<<4)

// GPIO45 Configuration

#define PADS_BANK0_GPIO45_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO45_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO45_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO45_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO45_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO45_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO45_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO45_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO45_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO45_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO45_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO45_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO45_DRIVE_12MA                    (0x3u<<4)

// GPIO46 Configuration

#define PADS_BANK0_GPIO46_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO46_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO46_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO46_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO46_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO46_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO46_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO46_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO46_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO46_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO46_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO46_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO46_DRIVE_12MA                    (0x3u<<4)

// GPIO47 Configuration

