Laur59/uKOS-X-IWYU/Tools/TestRom/Pico2_rp2350_RV32IMAC/Includes/SOC/Registers/RP2350_pads_bank0.h
#define PADS_BANK0_GPIO47_SLEWFAST                      (0x1u<<0)
#define PADS_BANK0_GPIO47_SCHMITT                       (0x1u<<1)
#define PADS_BANK0_GPIO47_PDE                           (0x1u<<2)
#define PADS_BANK0_GPIO47_PUE                           (0x1u<<3)
#define PADS_BANK0_GPIO47_DRIVE                         (0x3u<<4)
#define PADS_BANK0_GPIO47_DRIVE_0                       (0x1u<<4)
#define PADS_BANK0_GPIO47_IE                            (0x1u<<6)
#define PADS_BANK0_GPIO47_OD                            (0x1u<<7)
#define PADS_BANK0_GPIO47_ISO                           (0x1u<<8)
#define PADS_BANK0_GPIO47_DRIVE_2MA                     (0x0u<<4)
#define PADS_BANK0_GPIO47_DRIVE_4MA                     (0x1u<<4)
#define PADS_BANK0_GPIO47_DRIVE_8MA                     (0x2u<<4)
#define PADS_BANK0_GPIO47_DRIVE_12MA                    (0x3u<<4)

// SWCLK Configuration

#define PADS_BANK0_SWCLK_SLEWFAST                       (0x1u<<0)
#define PADS_BANK0_SWCLK_SCHMITT                        (0x1u<<1)
#define PADS_BANK0_SWCLK_PDE                            (0x1u<<2)
#define PADS_BANK0_SWCLK_PUE                            (0x1u<<3)
#define PADS_BANK0_SWCLK_DRIVE                          (0x3u<<4)
#define PADS_BANK0_SWCLK_DRIVE_0                        (0x1u<<4)
#define PADS_BANK0_SWCLK_IE                             (0x1u<<6)
#define PADS_BANK0_SWCLK_OD                             (0x1u<<7)
#define PADS_BANK0_SWCLK_ISO                            (0x1u<<8)
#define PADS_BANK0_SWCLK_DRIVE_2MA                      (0x0u<<4)
#define PADS_BANK0_SWCLK_DRIVE_4MA                      (0x1u<<4)
#define PADS_BANK0_SWCLK_DRIVE_8MA                      (0x2u<<4)
#define PADS_BANK0_SWCLK_DRIVE_12MA                     (0x3u<<4)

// SWD Configuration

#define PADS_BANK0_SWD_SLEWFAST                         (0x1u<<0)
#define PADS_BANK0_SWD_SCHMITT                          (0x1u<<1)
#define PADS_BANK0_SWD_PDE                              (0x1u<<2)
#define PADS_BANK0_SWD_PUE                              (0x1u<<3)
#define PADS_BANK0_SWD_DRIVE                            (0x3u<<4)
#define PADS_BANK0_SWD_DRIVE_0                          (0x1u<<4)
#define PADS_BANK0_SWD_IE                               (0x1u<<6)
#define PADS_BANK0_SWD_OD                               (0x1u<<7)
#define PADS_BANK0_SWD_ISO                              (0x1u<<8)
#define PADS_BANK0_SWD_DRIVE_2MA                        (0x0u<<4)
#define PADS_BANK0_SWD_DRIVE_4MA                        (0x1u<<4)
#define PADS_BANK0_SWD_DRIVE_8MA                        (0x2u<<4)
#define PADS_BANK0_SWD_DRIVE_12MA                       (0x3u<<4)
